InformationRegisters/ЛМ_КонтрагентыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛМ_КонтрагентыДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛМ_КонтрагентыДоставки/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Контрагент") тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛМ_КонтрагентыДоставки.КонтрагентДоставки
		|ИЗ
		|	РегистрСведений.ЛМ_КонтрагентыДоставки КАК ЛМ_КонтрагентыДоставки
		|ГДЕ
		|	ЛМ_КонтрагентыДоставки.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Параметры.Отбор.Контрагент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КонтрагентДоставки = Выборка.КонтрагентДоставки;
		Иначе
			Контрагент = Параметры.Отбор.Контрагент;
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаСервере 
Функция СтруктураПараметровОткрытияКонтрагента()
	Если ЗначениеЗаполнено(КонтрагентДоставки) Тогда
		Возврат Новый Структура("Ключ",КонтрагентДоставки);
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Структура("Контрагент",Контрагент);
	Иначе
		Возврат Неопределено
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтруктураПараметров = СтруктураПараметровОткрытияКонтрагента();
	Если Не СтруктураПараметров = Неопределено Тогда
		ФормаКонтрагентовДоставки = ПолучитьФорму("Справочник.ЛМ_Контрагенты.Форма.ФормаЭлемента", СтруктураПараметров);
		Отказ = Истина;
		ФормаКонтрагентовДоставки.Открыть()
	КонецЕсли;	
	
	
КонецПроцедуры
